# Bar Terminations Data Dispose Method

Source: https://www.revitapidocs.com/2026/f38dcd84-8e74-084b-d1ec-731b8a45c800.htm

---

| Bar Terminations Data Dispose Method |
| --- |

Releases all resources used by the BarTerminationsData
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

BarTerminationsData Class Autodesk.Revit.DB.Structure Namespace